<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a060c5a2a149fe6a0c0c5938abaec1ef60fb5d0cdfa58757421b214087470eef","plan_job_ref":"Job Staging Image Build & Push #12 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7347757464","plan_hash":"231c0781c58d7cb1c37ba5e64846c783d73e22192d5796d74ee1076ba9b36efe","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 4 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:12" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:12" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:d8653a6c06efff693b2444dda2ef42b79c8475aa" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:992252c0c8de77be14406cdbbe1d6d4bd5a2e9ae"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
!~      revision                 = 12 -> (known after apply)
-       tags                     = {} -> null
#        (7 unchanged attributes hidden)
    }

  # aws_lb_listener.listerner_443 will be created
+   resource "aws_lb_listener" "listerner_443" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0"
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = (known after apply)
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_listener_certificate.example will be created
+   resource "aws_lb_listener_certificate" "example" {
+       certificate_arn = "arn:aws:acm:us-east-1:806066816337:certificate/3848def8-0982-4f7e-b2be-664c6d00d101"
+       id              = (known after apply)
+       listener_arn    = (known after apply)
    }

  # aws_lb_target_group.target_group_P-5001 will be created
+   resource "aws_lb_target_group" "target_group_P-5001" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "alb-target-group-dev-443"
+       name_prefix                        = (known after apply)
+       port                               = 5000
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTPS"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       target_type                        = "ip"
+       vpc_id                             = "*********************"
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #12](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7347757464)